---
kind: type
id: T:Autodesk.Revit.UI.IRevisionsOnSheetUIServer
source: html/724d077c-5cc9-3878-0589-2b849cf449d9.htm
---
# Autodesk.Revit.UI.IRevisionsOnSheetUIServer

The interface used to provide UI for sheet's Revisions On Sheet property.

## Syntax (C#)
```csharp
public interface IRevisionsOnSheetUIServer : IExternalServer
```